# SQL 101 - The (unofficial) Workbook

## How to use this notebook

**Step 1: Run the cell below to connect to set up the database and notebook**

Don't worry about what the code below does exactly. It is simply used to setup this notebook for the lesson:

In [9]:
# Load libraries
try:
    import os
    import pandas as pd
    import duckdb
except ImportError:
    print("Installing necessary packages...")
    !pip install --quiet duckdb duckdb_engine pandas jupysql
    print("You may need to restart the kernel for this to take effect.")
    import pandas as pd
    import duckdb

# Set configurations for notebook
%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

# Load the "database"
salesman = pd.read_csv("data/SALESMAN.csv")
customer = pd.read_csv("data/CUSTOMER.csv")
order_details = pd.read_csv("data/ORDERDETAILS.csv")
foods = pd.read_csv("data/foods.csv")
company = pd.read_csv("data/company.csv")

# Set connection
%sql duckdb:///:memory:

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

**Step 2: Run a query**

To run SQL queries against the database, make sure that the cell you are writing in has `%%sql` written at the top. You can write your queries underneath that and run the cell to execute them. 

Go ahead and try it by executing the query in the cell below:

In [2]:
%%sql

SELECT *
FROM customer

   customer_id           cust_name        city       grade  salesman_id
0         3002        Nick Rimando    New York       100.0         5001
1         3005         Graham Zusi  California       200.0         5002
2         3001          Brad Guzan      London         NaN         5005
3         3004        Fabian Johns       Paris       300.0         5006
4         3007          Brad Davis    New York       200.0         5001
5         3009        Geoff Camero      Berlin       100.0         5003
6         3008        Julian Green      London       300.0         5002
7         3003        Jozy Altidor      Moscow       200.0         5007
8            1  Thomas A. Anderson    Neo York  10110101.0         5008

## Practice: Writing a SQL Query

Write a SQL statement to display all the information of all salesmen.

Table: `salesman`

In [ ]:
%%sql

-- Write your query under this line---
SELECT *
FROM salesman

## Practice: Queries with constraints

Write a SQL statement to display the name and city of all salesmen who are based in Paris.

In [ ]:
%%sql

-- Write your query under this line---
SELECT city, COUNT(name)
FROM salesman
GROUP BY city

## Practice: More queries with constraints

Write a SQL statement to display all the information for those customers with a grade of 200.

Table: `customer`

In [ ]:
%%sql

-- Write your query under this line---
SELECT *
FROM customer
WHERE grade=200;

## Basic Pattern Matching

Pattern matching is a powerful feature in SQL that allows you to search for patterns within text data. The `LIKE` operator is used in SQL to perform pattern matching. Here are some of the basics of pattern matching using the `LIKE`, `%`, and `_` operators:

#### `LIKE` with the `%` Operator
The `%` is known as a wildcard operator. This means that it can be used to match zero (think blank spaces) to many characters in a given string. Here are some examples of how we can use it to filter for text patterns in our data.

The following code:

```sql
SELECT *
FROM table
WHERE column LIKE 'COOP%';
```

will filter for and match any strings that are like the following:
```
“COOP”
“COOP Careers”
“COOP Careers: Overcoming Underemployment”
```

Essentially, this *filters for any text string that starts with* the word “COOP”. We can also use the `%` operator to *filter for words within a given text string.*

The following code:

```sql
SELECT *
FROM table
WHERE column LIKE '%COOP%';
```

will filter for and match any strings that are like the following:
```
“COOP Careers”
“COOP”
“It’s pronounced ‘COOP’ not ‘COOP’”
```
#### `LIKE` with the `_` Operator

The `_` operator is also a wildcard operator, just like `%`. The only difference is that `_` only matches any single character.

The following code:

```sql
SELECT *
FROM table
WHERE column LIKE 'COOP_';
```

will filter for and match any strings that are like the following:

```
“COOP”
“COOP “
“COOP1”
```

but it will not match strings like **“COOP12”** or **“COOP12345*”**.

-------------------------------------------------------------------------------

## Practice: Pattern Matching Queries

table: `customer`

1. Using the `customer` table, write a query that displays all the customers with the first name **Brad**:

In [8]:
%%sql

-- Write your query under this line---
SELECT *
FROM customer
WHERE cust_name LIKE 'Brad%'

   customer_id   cust_name      city  grade  salesman_id
0         3001  Brad Guzan    London    NaN         5005
1         3007  Brad Davis  New York  200.0         5001

2. Write a query that displays all cities that have the letter "i" in their name 

*e.g. Paris -- there is an "i" in Paris, so it is in the results)*

In [7]:
%%sql

-- Write your query under this line---
SELECT city
FROM customer
WHERE city LIKE '%i%'

         city
0  California
1       Paris
2      Berlin

3. Write a query that filters for rows that match this pattern: `Ne* York`

The asterisk(*) here means that it can match any **single** letter or number.

In [6]:
%%sql

-- Write your query under this line---
SELECT *
FROM customer
WHERE city LIKE 'Ne_ York'

   customer_id           cust_name      city       grade  salesman_id
0         3002        Nick Rimando  New York       100.0         5001
1         3007          Brad Davis  New York       200.0         5001
2            1  Thomas A. Anderson  Neo York  10110101.0         5008

## More resources for further practice

- [SQL Bolt](https://sqlbolt.com/): The lessons here are a great introduction to SQL and you know the platform already!
- [Mode](https://mode.com/sql-tutorial/): A comprehensive SQL tutorial from beginner all the way to advanced SQL. There's even a data analytics with SQL tutorial. This is a great resource to learn about SQL in depth and practice what you learn in their online database.
- [StrataScratch](https://platform.stratascratch.com/coding): Practice coding questions geared toward data analysts and data scientists. You can solve coding problems used by real companies for technical interviews using PostgresSQL, Python, R, or MySQL. It's free to sign up!
- [Codecademy - Free Learn SQL Course](https://www.codecademy.com/learn/learn-sql): Codecademy is another great resource to learn SQL as well as most other languages. There are a lot of free resources here that can help you learn SQL, Python, R, and many other languages.
- [Socratica SQL (YouTube)](https://www.youtube.com/watch?v=nWyyDHhTxYU&list=PLih4ch-U2DiBbMoFK4ML9faT3k3MM2UQY): This is a great playlist that will get you started learning SQL with one of the most popular relational databases - Postgres.
- [DB Fiddle](https://dbfiddle.uk/): This site is like a SQL scratch pad. You can use it to practice doing stuff like creating tables and inserting data into them, and all sorts of other stuff that you might not be able to do so freely in a live database. It's a sandbox, basically. Here are a couple of links to fiddles with some data in them to play with: [fiddle 1](https://dbfiddle.uk/?rdbms=postgres_13&fiddle=366b683701596d3f7459b0411c15acd1) and [fiddle 2](https://dbfiddle.uk/?rdbms=postgres_13&fiddle=dfffc1939f629d9286c55d732fb656c5).


And don't forget to keep your [SQL Cheatsheet](https://martinmarroyo.github.io/sqlcheatsheetandresources-coop/) handy!